In [81]:
import unicodecsv

#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [82]:
user = read_csv('../data_20180120/customer.csv')

In [161]:
import pandas as pd

users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [79]:
users['CUSTOMER_ID'][:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [80]:
users['DATE_OF_BIRTH'][:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [78]:
ID = users['CUSTOMER_ID']
ID[:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [243]:
import locale
locale.setlocale(locale.LC_ALL, '') 

new_id = result[:]
new_id['CUSTOMER_ID'] = result['CUSTOMER_ID'].apply(locale.atoi)
new_id[:5]

   CUSTOMER_ID
0         2083
1         2102
2         2223
3         2224
4         2284

In [77]:
BD = users['DATE_OF_BIRTH']
BD[:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [244]:
result = pd.concat([new_id, BD], axis=1)

In [245]:
result[:5]

   CUSTOMER_ID DATE_OF_BIRTH
0         2083    1988-10-30
1         2102
2         2223
3         2224
4         2284

# ID & Birth

In [248]:
Id_birth = result[result['DATE_OF_BIRTH'].notnull() & (result['DATE_OF_BIRTH'] != "")]
Id_birth[:5]

    CUSTOMER_ID DATE_OF_BIRTH
0          2083    1988-10-30
13         2390     1986-8-11
16         2406    1983-10-10
21         2412    1989-10-25
22         2413      1982-6-4

In [249]:
Id_birth.to_csv('../data_clean/customer.csv')

In [250]:
AD = users['ADDRESS_POSTAL_CODE']
AD[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [252]:
results = pd.concat([new_id,BD,AD], axis=1)
results[:5]

   CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0         2083    1988-10-30               20170
1         2102
2         2223
3         2224
4         2284

ID&Birth&address

In [253]:
df_add_not_null = results [results['ADDRESS_POSTAL_CODE'].notnull() & (results['ADDRESS_POSTAL_CODE'] != "") & (results['DATE_OF_BIRTH'].notnull() &(results['DATE_OF_BIRTH'] != ""))]


df_add_not_null[:5]

    CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0          2083    1988-10-30               20170
13         2390     1986-8-11               10250
16         2406    1983-10-10               10150
21         2412    1989-10-25               11110
22         2413      1982-6-4               11000

In [254]:
df_add_not_null.to_csv('../data_clean/customer.csv')

# birth

In [255]:
y_m_d = df_add_not_null['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [256]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 5, 15, 31, 37, 800110)

In [257]:
 y = now.year
y

2018

In [258]:
 y- int('1988')

30

In [259]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [262]:
bd_to_age('1988-10-30')

29.28767123287671

In [263]:
birth_not_null = users[users['DATE_OF_BIRTH'].notnull() &(users['DATE_OF_BIRTH'] != "")]['DATE_OF_BIRTH']
birth_not_null[0:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

# Age

In [264]:
 age = birth_not_null.apply(bd_to_age)
age[:5]

0     29.287671
13    31.509589
16    34.347945
21    28.301370
22    35.698630
Name: DATE_OF_BIRTH, dtype: float64

In [265]:
birth_not_null.to_csv('../data_clean/customer.csv')

In [266]:
users_all = pd.concat([df_add_not_null,age], axis=1)
users_all[:5]

    CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0        2083.0     1988-10-30               20170      29.287671
13       2390.0      1986-8-11               10250      31.509589
16       2406.0     1983-10-10               10150      34.347945
21       2412.0     1989-10-25               11110      28.301370
22       2413.0       1982-6-4               11000      35.698630

In [267]:
users_all['Age'] = age

In [268]:
users_all[:5]

    CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH        Age
0        2083.0     1988-10-30               20170      29.287671  29.287671
13       2390.0      1986-8-11               10250      31.509589  31.509589
16       2406.0     1983-10-10               10150      34.347945  34.347945
21       2412.0     1989-10-25               11110      28.301370  28.301370
22       2413.0       1982-6-4               11000      35.698630  35.698630

In [2]:

user.all = del users_all['DATE_OF_BIRTH']
user.all

SyntaxError: invalid syntax (<ipython-input-2-c184489e89c7>, line 2)

In [270]:
users_all.to_csv('../data_clean/customer.csv')

# check

In [271]:
users_all.dtypes

CUSTOMER_ID            float64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

In [293]:
new_age = users_all['Age'].round(0)
new_age[:5]

0     29.0
13    32.0
16    34.0
21    28.0
22    36.0
Name: Age, dtype: float64